function product(name, price, img, description, category) {
    this.name = name;
    this.price = price;
    this.img = img;
    this.description = description;
    this.category = category;
}

var arr1 = JSON.parse(localStorage.getItem("arr1"));
if (arr1 == null)
    arr1 = [];
let bangle1 = new product("צמיד בנגל איטרניטי", 295, "../images/img1.jpg", "צמיד סגר מנצנץ מסדרת Pandora Reflexions מוסיף נצנוץ עדין לכל לבוש שתבחרי. עם גימור כסף סטרלינג בעבודת יד, צמיד זה מרשת שטוחה כולל סגר מלבני מיוחד המופיע לראשונה על צמיד Pandora Reflexions. הסגר כולל אבנים בגדלים שונים ואת הלוגו של Pandora מצדו האחורי. הסגר גם עבר תהליך חמצון כך שמראהו ישתנה עם הזמן וייצור רקע מנוגד ויפהפה. שלבי עם עגילי סטרלינג צמודים למראה מהודר ומנצנץ.","bangles");
arr1[0]=bangle1;
let bangle2 = new product("צמיד בנגל פתוח עם סוגר כסף מתחלף בשיבוץ פאווה", 450, "../images/img2.jpg", " צמיד בנגל מכסף סטרלינג, עם שתי תושבות וסוגרים מתחלפים בשיבוץ זרקונים נוצצים", "bangles");
arr1.push(bangle2);
let bangle3 = new product("צמיד שיין מומנטס כתר נוצץ", 300, "../images/img3.jpg", "צמיד זהב מומנטס עם סגירת כתר משובץ זרקורים נוצצים", "bangles");
arr1.push(bangle3);
let bangle4 = new product("צמיד כסף בנגל דק", 250, "../images/img4.jpg", "צמיד בנגל מכסף סטרלינג", "bangles");
arr1.push(bangle4);

let necklace1 = new product("שרשרת כסף לב מרחף", 500, "../images/img9.jpg", "שרשרת מכסף סטרלינג בשיבוץ 19 זרקונים נוצצים","necklaces");
arr1.push(necklace1);
let necklace2 = new product("שרשרת כסף טרופיקנה בשיבוץ זרקונים", 650, "../images/img10.jpg", "שרשרת כסף טרופיקנה בשיבוץ זרקונים", "necklaces");
arr1.push(necklace2);
let necklace3 = new product("שרשרת כסף אינפיניטי", 400, "../images/img11.jpg", "שרשרת תליון אינפינטי עדינה מסמלת אהבת נצח. העיצוב המסנוור מכסף סטרלינג עוטר באבני זירקון שקופות לתוספת נצנוץ. בהשראת הקשר הנצחי בין אמהות לילדים סמל האינפיניטי יבטא את רגשותייך במדויק עם סמל בעל משמעות אוניברסלית לקשר עמוק. שרשרת מושלמת ליצירת סטיילינג עם תכשיטי אינפיניטי אחרים או מתנה לאישה אהובה עד לסוף כל הזמנים.","necklaces");
arr1.push(necklace3);
let necklace4 = new product("שרשרת כסף חרצית פאווה", 750, "../images/img12.jpg","שרשרת מכסף סטרלינג בשיבוץ מיקרו זרקון ו-7 זרקונים נוצצים","necklaces");
arr1.push(necklace4);

let ring1 = new product("טבעת כסף אלגנטיות כפולה", 250, "../images/img5.jpg", "טבעת מכסף סטרלינג בשיבוץ 41 זרקונים נוצצים","rings");
arr1.push(ring1);
let ring2 = new product("טבעת שיין מעטפת פאווה", 600, "../images/img6.jpg", "לכי על לוק שכבות לינארי עם טבעת שלושה מעגלים מוצלבים בשיבוץ פאווה. עם גימור ידני בציפוי זהב 14k, הטבעת כוללת שלושה מעגילים, שאחד מהם חופף באלכסון את שני המעגלים הנותרים. מעגל פנימי אחד עוטר בתבליט לוגו Pandora, השני לוטש והמעגל החיצוני כולל שיבוץ פאווה של 25 אבני זירקון שקופות עם מסגרת מיקרו חרוזים. בהשראת המבנה המהפנט של מערכת השמש, הטבעת תוסיף שיק מובנה וחלקלק לכל לוק.", "rings");
arr1.push(ring2);
let ring3 = new product("טבעת שיין כתר נוצץ", 350, "../images/img7.jpg", "לכי על לוק מלא באלגנטיות זוהרת עם טבעת סוליטר כתר מנצנץ שקוף. עם גימור ידני בציפוי זהב 14 קרט, טבעת הסוליטר כוללת אבן זירקון מרכזית שקופה, בשיבוץ שיניים בצורת כתר. השיבוץ וגוף הטבעת קושטו באבני זירקון שקופות, שמעניקות אפילו יותר ברק לטבעת. בהשראת המראה של כתר מלכותי, הטבעת תוסיף נגיעה מלכותית לכל לוק.", "rings");
arr1.push(ring3);
let ring4 = new product("טבעת כסף לוגו ולבבות", 550, "../images/img8.jpg", "צאי בהצהרת סטייל אלגנטית עם שרשרת מעגל פאווה ולוגו Pandora. עם גימור בעבודת יד ממתכת בציפוי זהב 14 קרט, השרשרת כוללת מעגל פתוח בשיבוץ פאבה של 6 אבני זירקון שקופות. שיבוץ הפאבה מוסגר במיקרו חרוזים וצדי המעגל עוטרו בחיתוכי לבבות. צדו האחורי של המעגל לוטש ונחרט בלוגו Pandora. שרשרת מושלמת שתשדרג כל לוק, לסטייל יומיומי או לאירועים מיוחדים.", "rings");
arr1.push(ring4);
localStorage.setItem('arr1', JSON.stringify(arr1));


